davidalexandercurrie/485/FINAL_PROJECT/esp32Mozzi/lib/Mozzi-master/MozziGuts 12.40.06.cpp
/*
static void receiveFirstAudioADC()
{
	// nothing
}
*/

static void startSecondAudioADC()
{
#if IS_TEENSY3()
	adc->startSingleRead(AUDIO_INPUT_PIN);
#elif IS_STM32()
	uint8_t dummy = AUDIO_INPUT_PIN;
	adc.setPins(&dummy, 1);
	adc.startConversion();
#else
	ADCSRA |= (1 << ADSC); // start a second conversion on the current channel
#endif
}



static void receiveSecondAudioADC()
{
	if (!input_buffer.isFull())
#if IS_TEENSY3()
		input_buffer.write(adc->readSingle());
#elif IS_STM32()
	input_buffer.write(adc.getData());
#else
		input_buffer.write(ADC);
#endif
}

#if !IS_SAMD21() && !IS_DUE()

#if IS_TEENSY3()
void adc0_isr(void)
#elif IS_STM32()
void stm32_adc_eoc_handler()
#else
ISR(ADC_vect, ISR_BLOCK)
#endif
{
	switch (adc_count){
	case 0:
		// 6us
		receiveSecondAudioADC();
		adcReadSelectedChannels();
		break;

	case 1:
		// <2us, <1us w/o receive
		//receiveFirstControlADC();
		startSecondControlADC();
		break;

	case 2:
		// 3us
		receiveSecondControlADC();
		startFirstAudioADC();
		break;


		//      	case 3:
		// invisible
		//      	receiveFirstAudioADC();
		//      	break;

	}
	adc_count++;
}
#endif // end main audio input section
#endif


#if IS_SAMD21()
// These are ARM SAMD21 Timer 5 routines to establish a sample rate interrupt
static bool tcIsSyncing()
{
    return TC5->COUNT16.STATUS.reg & TC_STATUS_SYNCBUSY;
}

static void tcStartCounter()
{
    // Enable TC

    TC5->COUNT16.CTRLA.reg |= TC_CTRLA_ENABLE;
    while (tcIsSyncing());
}

static void tcReset()
{
    // Reset TCx
    TC5->COUNT16.CTRLA.reg = TC_CTRLA_SWRST;
    while (tcIsSyncing());
    while (TC5->COUNT16.CTRLA.bit.SWRST);
}

static void tcDisable()
{
    // Disable TC5
    TC5->COUNT16.CTRLA.reg &= ~TC_CTRLA_ENABLE;
    while (tcIsSyncing());
}
static void tcEnd() {
    tcDisable();
    tcReset();
    analogWrite(AUDIO_CHANNEL_1_PIN, 0);

}


static void tcConfigure(uint32_t sampleRate)
{
    // Enable GCLK for TCC2 and TC5 (timer counter input clock)
    GCLK->CLKCTRL.reg = (uint16_t) (GCLK_CLKCTRL_CLKEN | GCLK_CLKCTRL_GEN_GCLK0 | GCLK_CLKCTRL_ID(GCM_TC4_TC5)) ;
    while (GCLK->STATUS.bit.SYNCBUSY);

    tcReset();

    // Set Timer counter Mode to 16 bits
    TC5->COUNT16.CTRLA.reg |= TC_CTRLA_MODE_COUNT16;

    // Set TC5 mode as match frequency
    TC5->COUNT16.CTRLA.reg |= TC_CTRLA_WAVEGEN_MFRQ;

    TC5->COUNT16.CTRLA.reg |= TC_CTRLA_PRESCALER_DIV1 | TC_CTRLA_ENABLE;

    TC5->COUNT16.CC[0].reg = (uint16_t) (SystemCoreClock / sampleRate - 1);
    while (tcIsSyncing());

    // Configure interrupt request
    NVIC_DisableIRQ(TC5_IRQn);
    NVIC_ClearPendingIRQ(TC5_IRQn);
    NVIC_SetPriority(TC5_IRQn, 0);
    NVIC_EnableIRQ(TC5_IRQn);

    // Enable the TC5 interrupt request
    TC5->COUNT16.INTENSET.bit.MC0 = 1;
    while (tcIsSyncing());
}
#endif

#if IS_DUE()
#endif

#if IS_ESP8266()
// lookup table for fast pdm coding on 8 output bits at a time
static byte fast_pdm_table[] {0, 0b00010000, 0b01000100, 0b10010010, 0b10101010, 0b10110101, 0b11011101, 0b11110111, 0b11111111};

inline void writePDMCoded(uint16_t sample) {
	static uint32_t lastwritten = 0;
	static uint32_t nexttarget = 0;

        // We can write 32 bits at a time to the output buffer, typically, we'll do this either once of twice per sample
	for (uint8_t words = 0; words < PDM_RESOLUTION; ++words) {
		uint32_t outbits = 0;
		for (uint8_t i = 0; i < 4; ++i) {
			nexttarget += sample - lastwritten;
			lastwritten = nexttarget & 0b11110000000000000; // code the highest 3-and-a-little bits next.
			                                                // Note that sample only has 16 bits, while the highest bit we consider for writing is bit 17.
			                                                // Thus, if the highest bit is set, the next three bits cannot be.
	#if (ESP_AUDIO_OUT_MODE == PDM_VIA_SERIAL)
			U1F = fast_pdm_table[lastwritten >> 13];  // optimized version of: Serial1.write(...);
	#else
			outbits = outbits << 8;
			outbits |= fast_pdm_table[lastwritten >> 13];
	#endif
                }
	#if (ESP_AUDIO_OUT_MODE == PDM_VIA_I2S)
		i2s_write_sample (outbits);
	#endif
	}
}

	#if (ESP_AUDIO_OUT_MODE == PDM_VIA_SERIAL)
void ICACHE_RAM_ATTR write_audio_to_serial_tx() {
#define OPTIMIZED_SERIAL1_AVAIALABLEFORWRITE (UART_TX_FIFO_SIZE - ((U1S >> USTXC) & 0xff))
	if (output_stopped) return;
	while (OPTIMIZED_SERIAL1_AVAIALABLEFORWRITE > (PDM_RESOLUTION*4)) {
		writePDMCoded(output_buffer.read());
	}
}
	#else
inline void espWriteAudioToBuffer() {
		#if (ESP_AUDIO_OUT_MODE == EXTERNAL_DAC_VIA_I2S)
			#if (STEREO_HACK == true)
	updateAudio ();
	i2s_write_lr(audio_out_1, audio_out_2);
			#else
	i2s_write_lr(updateAudio(), 0);
			#endif
		#else
	uint16_t sample = updateAudio() + AUDIO_BIAS;
	writePDMCoded(sample);
		#endif
	++samples_written_to_buffer;
}
	#endif
#endif



static uint16_t update_control_timeout;
static uint16_t update_control_counter;
static void updateControlWithAutoADC();
void audioHook() // 2us excluding updateAudio()
{
//setPin13High();
#if (USE_AUDIO_INPUT==true)
		if (!input_buffer.isEmpty())
			audio_input = input_buffer.read();
#endif

#if IS_ESP8266() && (ESP_AUDIO_OUT_MODE != PDM_VIA_SERIAL)
	#if (PDM_RESOLUTION != 1)
	if (i2s_available() >= PDM_RESOLUTION) {
	#else
	if (!i2s_is_full()) {
	#endif
#else
	if (!output_buffer.isFull()) {
#endif
		if (!update_control_counter) {
			update_control_counter = update_control_timeout;
			updateControlWithAutoADC ();
		} else {
			--update_control_counter;
		}
#if IS_ESP8266() && (ESP_AUDIO_OUT_MODE != PDM_VIA_SERIAL)
		//NOTE: On ESP / output via I2S, we simply use the I2S buffer as the output buffer, which saves RAM, but also simplifies things a lot
		// esp. since i2s output already has output rate control -> no need for a separate output timer
		espWriteAudioToBuffer();
#else
		#if (STEREO_HACK == true)
		updateAudio(); // in hacked version, this returns void
		output_buffer.write((unsigned int) (audio_out_1 + AUDIO_BIAS));
		output_buffer2.write((unsigned int) (audio_out_2 + AUDIO_BIAS));
		#else
		output_buffer.write((unsigned int) (updateAudio() + AUDIO_BIAS));
		#endif
#endif

