davidalexandercurrie/485/FINAL_PROJECT/esp32Mozzi/lib/Mozzi-master/MozziGuts 12.40.06.cpp
#if IS_ESP8266()
		yield();
#endif
	}
//setPin13Low();
}

#if IS_SAMD21()
        void TC5_Handler (void) __attribute__ ((weak, alias("samd21AudioOutput")));
#endif

#if IS_DUE()
#endif

//-----------------------------------------------------------------------------------------------------------------
#if (AUDIO_MODE == STANDARD) || (AUDIO_MODE == STANDARD_PLUS) || IS_STM32()
#if IS_SAMD21() || IS_DUE()
#ifdef __cplusplus
    extern "C" {
#endif

        void samd21AudioOutput(void);
#ifdef __cplusplus
    }
#endif

#elif    IS_TEENSY3()
  IntervalTimer timer1;
#elif IS_STM32()
  HardwareTimer audio_update_timer(AUDIO_UPDATE_TIMER);
  HardwareTimer audio_pwm_timer(AUDIO_PWM_TIMER);

#endif

#if IS_SAMD21()
#ifdef __cplusplus
    extern "C" {
#endif

     void samd21AudioOutput()
    {

#if (USE_AUDIO_INPUT==true)
        adc_count = 0;
        startSecondAudioADC();
#endif
        analogWrite(AUDIO_CHANNEL_1_PIN, (int)output_buffer.read());
        TC5->COUNT16.INTFLAG.bit.MC0 = 1;

    }
#ifdef __cplusplus
    }
#endif

#elif IS_DUE()
static void dueAudioOutput() {
  dacc_set_channel_selection(DACC_INTERFACE, AUDIO_CHANNEL_1);    
  dacc_write_conversion_data(DACC_INTERFACE, (int)output_buffer.read());
}

#elif IS_ESP32()
static void IRAM_ATTR esp32AudioOutput() {
	int out32=(int)output_buffer.read();
	i2s_write_bytes((i2s_port_t)i2s_num, (const char *)&out32, sizeof(uint32_t), 0);

}

#elif IS_TEENSY3()
static void teensyAudioOutput()
{

#if (USE_AUDIO_INPUT==true)
	adc_count = 0;
	startSecondAudioADC();
#endif

	analogWrite(AUDIO_CHANNEL_1_PIN, (int)output_buffer.read());
}
#elif IS_STM32()
static void pwmAudioOutput()
{
#if (USE_AUDIO_INPUT==true)
	adc_count = 0;
	startSecondAudioADC();
#endif

#if (AUDIO_MODE == HIFI)
	int out = output_buffer.read();
	pwmWrite(AUDIO_CHANNEL_1_PIN, out & ((1 << AUDIO_BITS_PER_CHANNEL) - 1));
	pwmWrite(AUDIO_CHANNEL_1_PIN_HIGH, out >> AUDIO_BITS_PER_CHANNEL);
#else
	pwmWrite(AUDIO_CHANNEL_1_PIN, (int)output_buffer.read());
#endif
}
#endif

#if !IS_AVR()
static void startAudioStandard()
{

#if IS_TEENSY3()
	adc->setAveraging(0);
	adc->setConversionSpeed(ADC_CONVERSION_SPEED::MED_SPEED); // could be HIGH_SPEED, noisier

	analogWriteResolution(12);
	timer1.begin(teensyAudioOutput, 1000000UL/AUDIO_RATE);
#elif IS_SAMD21()
#ifdef ARDUINO_SAMD_CIRCUITPLAYGROUND_EXPRESS
    {
        static const int CPLAY_SPEAKER_SHUTDOWN= 11;
        pinMode(CPLAY_SPEAKER_SHUTDOWN, OUTPUT);
        digitalWrite(CPLAY_SPEAKER_SHUTDOWN, HIGH);
    }

#endif
    analogWriteResolution(12);
    analogWrite(AUDIO_CHANNEL_1_PIN, 0);
    tcConfigure(AUDIO_RATE);
#elif IS_DUE()
  analogWriteResolution(12);
  Timer6.attachInterrupt(dueAudioOutput).setFrequency(AUDIO_RATE).start();
  analogWrite(AUDIO_CHANNEL_1_PIN,0);
  analogWrite(AUDIO_CHANNEL_2_PIN,0);
  
  
  
#elif IS_ESP32()
  i2s_driver_install((i2s_port_t)i2s_num, &i2s_config, 0, NULL);
  i2s_set_pin((i2s_port_t)i2s_num, &pin_config);
  //i2s_set_sample_rates((i2s_port_t)i2s_num, AUDIO_RATE);
  i2s_set_sample_rates((i2s_port_t)i2s_num, 44100);    
  i2s_zero_dma_buffer((i2s_port_t)i2s_num);
  timer = timerBegin(0, 80, true);
  timerAttachInterrupt(timer, &esp32AudioOutput, true);
	// zc - 45 microseconds is ok for now
  timerAlarmWrite(timer, 45, true);
  /* Start an alarm */
  timerAlarmEnable(timer);
  
  
#elif IS_STM32()
    audio_update_timer.pause();
	audio_update_timer.setPeriod(1000000UL/AUDIO_RATE);
	audio_update_timer.setChannel1Mode(TIMER_OUTPUT_COMPARE);
	audio_update_timer.setCompare(TIMER_CH1, 1);  // Interrupt 1 count after each update
	audio_update_timer.attachCompare1Interrupt(pwmAudioOutput);
	audio_update_timer.refresh();
	audio_update_timer.resume();

	pinMode(AUDIO_CHANNEL_1_PIN, PWM);
#if (AUDIO_MODE == HIFI)
	pinMode(AUDIO_CHANNEL_1_PIN_HIGH, PWM);
#endif

#define MAX_CARRIER_FREQ (F_CPU/(1<<AUDIO_BITS_PER_CHANNEL))
#if MAX_CARRIER_FREQ < AUDIO_RATE
#error Configured audio resolution is definitely too high at the configured audio rate (and the given CPU speed)
#elif MAX_CARRIER_FREQ < (AUDIO_RATE * 3)
#warning Configured audio resolution may be higher than optimal at the configured audio rate (and the given CPU speed)
#endif

#if MAX_CARRIER_FREQ < (AUDIO_RATE * 5)
	// Generate as fast a carrier as possible
	audio_pwm_timer.setPrescaleFactor(1);
#else
	// No point in generating arbitrarily high carrier frequencies. In fact, if there _is_ any headroom, give the PWM pin more time to swing from HIGH to LOW and BACK, cleanly
	audio_pwm_timer.setPrescaleFactor((int) MAX_CARRIER_FREQ / (AUDIO_RATE * 5));
#endif
	audio_pwm_timer.setOverflow(1 << AUDIO_BITS_PER_CHANNEL);   // Allocate enough room to write all intended bits

#elif IS_ESP8266()
	#if (ESP_AUDIO_OUT_MODE == PDM_VIA_SERIAL)
	output_stopped = false;
	Serial1.begin(AUDIO_RATE*(PDM_RESOLUTION*40), SERIAL_8N1, SERIAL_TX_ONLY);  // Note: PDM_RESOLUTION corresponds to packets of 32 encoded bits  However, the UART (unfortunately) adds a
	                                                                            // start and stop bit each around each byte, thus sending a total to 40 bits per audio sample per PDM_RESOLUTION.
	// set up a timer to copy from Mozzi output_buffer into Serial TX buffer
	timer1_isr_init();
	timer1_attachInterrupt(write_audio_to_serial_tx);
	// UART FIFO buffer size is 128 bytes. To be on the safe side, we keep the interval to the time needed to write half of that.
	// PDM_RESOLUTION * 4 bytes per sample written.
	timer1_enable(TIM_DIV16, TIM_EDGE, TIM_LOOP);
	timer1_write(F_CPU / (AUDIO_RATE*PDM_RESOLUTION));
	#else
	i2s_begin();
	#if (ESP_AUDIO_OUT_MODE == PDM_VIA_I2S)
	pinMode(2, INPUT);  // Set the two unneeded I2S pins to input mode, to reduce side effects
	pinMode(15, INPUT);
	#endif
	i2s_set_rate(AUDIO_RATE*PDM_RESOLUTION);
	if (output_buffer_size == 0) output_buffer_size = i2s_available(); // Do not reset count when stopping / restarting
	#endif
#endif

}

#else

// avr architecture
static void startAudioStandard()
{
	backupPreMozziTimer1();

	pinMode(AUDIO_CHANNEL_1_PIN, OUTPUT);	// set pin to output for audio
	//	pinMode(AUDIO_CHANNEL_2_PIN, OUTPUT);	// set pin to output for audio
#if (AUDIO_MODE == STANDARD)
	Timer1.initializeCPUCycles(F_CPU/AUDIO_RATE, PHASE_FREQ_CORRECT);		// set period, phase and frequency correct
#else // (AUDIO_MODE == STANDARD_PLUS)
	Timer1.initializeCPUCycles(F_CPU/PWM_RATE, FAST);	// fast mode enables higher PWM rate
#endif
	Timer1.pwm(AUDIO_CHANNEL_1_PIN, AUDIO_BIAS);		// pwm pin, 50% of Mozzi's duty cycle, ie. 0 signal
#if (STEREO_HACK == true)
	Timer1.pwm(AUDIO_CHANNEL_2_PIN, AUDIO_BIAS);	// sets pin to output
#endif
	TIMSK1 = _BV(TOIE1); 	// Overflow Interrupt Enable (when not using Timer1.attachInterrupt())
}


/* Interrupt service routine moves sound data from the output buffer to the
Arduino output register, running at AUDIO_RATE. */

ISR(TIMER1_OVF_vect, ISR_BLOCK)
{

#if (AUDIO_MODE == STANDARD_PLUS) && (AUDIO_RATE == 16384) // only update every second ISR, if lower audio rate
	static boolean alternate;
	alternate = !alternate;
	if(alternate)
	{
#endif

